
 {
    "meta": {
      "author": "Kevin Krempels und Rouven Krinke",
      "version": "1.0",
      "uuid": "41612df6-920a-11eb-a8b3-0242ac130003"
    },
    "decks": {
      "defiAndBlockchain": {
        "meta": {
          "deck_name": "Educational Defi and Blockchain Deck",
          "next_card_id": 5,
          "description": "This is a deck for educational purposes. It uses components Klopapier.Exchange Website."
        },
        "cards": {
          "0": {
            "q": "Was versteht man unter der 'Distributed-Ledger-Technologie'?",
            "a": "Unter der Distributed-Ledger-Technologie wird eine Technik beschrieben, die für die Dokumentation bestimmter Transaktionen benutzt wird. Dabei wird ein dezentrales Hauptbuch geführt, wobei beliebig viele Kopien des Hauptbuchs von unterschiedlichen Parteien unterhalten werden."
          },
          "1": {
            "q": "Was versteht man unter einer Blockchain?",
            "a": "Die Blockchain ist die Grundlage für Kryptowährungen. Dabei ist die Blockchain eine der bekanntesten Distributed-Ledger-Techniken und ist eine kontinuierlich erweiterbare Liste von Datensätzen, sogenannte Blöcke, die mittels kryptografischer Verfahren miteinander verkettet sind."
          },
          "2": {
            "q": "Was versteht man unter dem Begriff 'Smart Contracts'?",
            "a": "Smart Contracts, sogenannte intelligente Verträge, sind elektronische Verträge, die basierend auf einem Computerprogramm Abläufe im Geschäftsleben rechtssicher automatisieren können. Smart Contracts sind vergleichbar mit herkömmlichen Verträgen, wie sie beispielsweise beim Kauf eines Autos oder bei der Annahme eines Jobs abgeschlossen werden. Smart Contracts bauen auf der Blockchain-Technologie auf und nutzen die Vorteile der Technologie."
          }, 
          "3": {
            "q": "Nennen Sie vier Vorteile einer Blockchain",
            "a": "Unter anderem Transparenz, Fälschungssicherheit, Verfügbarkeit, Dezentralisierung."
          }, 
          "4": {
            "q": "Nennen Sie vier Nachteile einer Blockchain",
            "a": "Unter anderem steigende, verteilte Datenmengen und Herausforderungen an die Aufbewahrung, komplexe Umsetzungen und neue Technologien, schlechtere Performance als zentrale Netzwerke, Datenabfrage deutlich langsamer als bei herkömmlichen Datenbanken ."
          }, 
          "5": {
            "q": "Was versteht man unter einem ERC-721 Token",
            "a": "Unter dem Begriff ERC versteht man Ethereum Request for Comment. Das ist ein Genehmigungssystem in der Open-Source-Community, um revolutionäre Änderungen zu akzeptieren. ERCs dienen diesem Zweck für Ethereum, sie enthalten einige technische Richtlinien, die Vorschläge zur Entwicklung des Ethereum-Netzwerks ausarbeiten. Die Nummer 721 ist die eindeutige dem Token-Standard zugewiesene ID-Nummer. Dieser Token zeichnet sich unter anderem dadurch aus, dass er nicht austauschbar und nicht teilbar ist."
          }, 
          "6": {
            "q": "Was versteht man unter dem Begriff ERC-20 Token",
            "a": "Unter dem Begriff ERC-20 Token werden Token bezeichnet, welche die Blockchain von Ethereum benutzen. Sie verwenden einen offiziellen Smart Contract Standard, der wie eine Kryptowährung benutzt werden kann. Durch einen ERC20-Standard, wird es ermöglicht, dass Smart Contracts sich sehr ähnlich wie Kryptowährungen verhalten. Man kann einen standardisierten ERC20 Smart Contract als ERC20 Token bezeichnen, den man senden und empfangen kann. Durch ein paar Zeilen, bestehend aus einem Code, kann also ein Smart Contract (intelligenter Vertrag) wie eine Kryptowährung behandelt werden."
          }, 
          "7": {
            "q": "Was versteht man unter dem Begriff Konsens-Algorithmen",
            "a": "Der Konsens spielt beim Einsatz der Blockchain eine wesentliche Rolle. Mit diesem Mechanismus wird sichergestellt, dass Integrität der Daten in einem dezentralen Netzwerk bei allen Teilnehmern gewährleistet ist. Das eingesetzte Konsensverfahren spielt für Blockchains eine wichtige Rolle. Private und Öffentliche Blockchains nutzen den Konsens, um die Sicherheit und Datenintegrität auf allen Knoten zu gewährleisten. Der Konsens stellt die Integrität der Blöcke und deren einheitliche Synchronisierung im Netzwerk sicher. Es gibt unterschiedliche Konsensmechanismen, wie z.B. Proof of Work, Proof of Stake oder Byzantine Fault Tolerance"
          }, 
          "8": {
            "q": "Was sind Tokens?",
            "a": "Ein Token repräsentiert einen Vermögenswert, Vermögensgegenstand oder ein Wirtschaftsgut. Token die erstellt werden, benutzen bereits existierende Blockchains, die über Standardvorlagen, wie beispielsweise Smart Contracts auf der Ethereum Blockchain, generiert werden."
          }, 
          "9": {
            "q": "Was kann ein Token repräsentieren?",
            "a": "Ein Token kann entweder als Treibstoff für ein Blockchain-Netzwerk oder als Unternehmensanteile oder Stimmrechte in einem Blockchain Projekt dienen."
          }, 
          "10": {
            "q": "Was versteht man unter Utility Token?",
            "a": "Ein Utility Token kann während eines Initial Coin Offering (ICO) oder Token Sale ausgegeben werden. Dabei kann man einen bestimmten zukünftigen Nutzen erhalten. Die Funktion eines solchen Tokens kann im jeweiligen White Paper eines Blockchain Projekts entnommen werden. Solche Token können beispielsweise einen Zugang zu einem Dienst oder Service in Blockchain Projekten gewähren."
          }, 
           "11": {
            "q": "Was versteht man unter Security Token?",
            "a": "Unter einem Security Token versteht man einen Token, der aus einem externen, handelbaren Vermögenswert bezogen wird. Diese Token unterliegen den Bundeswertpapiervorschriften. Diese Art von Token besitzen einen finanziellen Anreiz für Investoren."
          }, 
           "12": {
            "q": "Was versteht man unter einem Equity Token?",
            "a": "Unter einem Equity Token versteht man einen Token, der seinen Zweck in einer Wertsteigerung sieht. Dadurch ist ein Equity Token mit einer Aktie vergleichbar. Mit einem solchen Token können alle Objekte aus der wirklichen Welt 'tokenisiert' werden."
          }, 
           "13": {
            "q": "Was versteht man unter Fiat Currency?",
            "a": "Dieser Begriff bezeichnet ein Zahlungsmittel, welches von einer Regierung oder einem Staat künstlich erschaffen worden ist. 'Fiatgeld' unterscheidet sich vom klassischen Warengeld (z.B. Reis, Gold,Silber), welches zusätzlich zu seinem Tauschwert auch einen inneren Wert hat. Der Begriff 'Fiat' stammt aus dem Lateinischen und bedeutet soviel wie 'geschehen' oder 'entstehen'. "
          },
           "14": {
            "q": "Was ist die bekannteste Anwendung einer Blockchain?",
            "a": "Die bekannste Anwendung einer Blockchain ist Bitcoin. Bitcoin ist eine Kryptowährung."
          }, 
            "15": {
            "q": "Was versteht man unter Crypto Wallets?",
            "a": "Crypto Wallets werden verwendet, um Kryptowährungen zu speichern und sichern und diese bei Gebrauch auch abrufen und verwenden können."
          },
            "16": {
            "q": "Von wem und wann wurden Crypto Wallets entworfen?",
            "a": "Crypto wallets wurden 2009 von Satoshi Nakamoto mit der ersten Veröffentlichung des Bitcoin vorgestellt."
          },
            "17": {
            "q": "Was ist Solidity?",
            "a": "Solidy ist eine objektorientierte Programmiersprache, welche zum Entwickeln von Smart Contracts auf Blockchainplattformen verwendet wird."
          },
            "18": {
            "q": "Nenne Beispiele für Kryptowährungen:",
            "a": "Bitcoin, Ethereum, Theter, Ripple, Cardano, Monero, Dogecoin"
          },
            "19": {
            "q": "Für was wird Solidity verwendet?",
            "a": "Wird verwendet, um Smart Contracts auf verschiedenen Blockchainplattformen zu entwickeln."
          },
            "20": {
            "q": "Was unterscheidet Decentralized Finance von traditionellen Finanzmärkten?",
            "a": "Decentralized Finance kommt ohne zentralisierte Infrastruktur, wie Börsenmakler, Wertpapierhändlern und Banken aus, welche im Gegensatz traditionelle Finanzmärkte als Intermediäre verwendet."
          },
            "21": {
            "q": "Welche zwei Arten von Oracles existieren?",
            "a": "Inbound Oracles (bringt Daten in die Blockchain), Outbound Oracles (gibt Daten der Blockchain (bsp. Events) nach außen weiter)"
          },
            "22": {
            "q": "Was sind Vorteile von Decentralized Finance?",
            "a": "Transparenz für alle Teilnehmer einer Blockchain, geringe Transaktionskosten, Quellcode kann von jedem eingesehen werden, garantiert korrekte Vertragsausführung, Abbildung von komplexen Finanzmärkten"
          },
            "23": {
            "q": "Was versteht man unter Decentrialized Finance?",
            "a": "Decentrialized Finance ist eine Blockchain-basierende Form eines Finanzmarktes. Hierbei basiert dies auf Smart Contracts und dezentralisierten autonomen Organisationen auf Blockchains."
          },
            "24": {
            "q": "Welche Verwendungsmöglichkeiten bietet Dezentralized Finance PLattformen?",
            "a": "Leihen oder Verleihen von Geld/Kryptowährungen, Spekulationen von einer Reihe von Vermögenswertem, handeln von Kryptowährungen, Versicherung von Risiken, Sparkonten"
          },
            "25": {
            "q": "Was versteht man unter Initial Coin Offering?",
            "a": "Initial Coin Offering ist eine Art der Finanzierung mittels Kryptowährungen, welches oft in Form von Crowdfunding verwendet wird. Hierbei werden Tokens (oder auch Coins genannt) an Spekulatoren und Investoren gegen andere Kryptowährungen verkauft. Dieses Geld kann dann zur Entwicklung eines Unternehmens verwendet werden."
          },
            "26": {
            "q": "Was versteht man unter einem Oracle in hinblick auf Blockchains?",
            "a": "Ein Oracle ist eine Möglichkeit für eine Blockchain oder einem Smart Contract mit externen Daten zu interagieren. Hierbei gibt es zwei unterschiedliche Arten, Inbound Oracles und Outbound Oracles."
          }
        }
      }
    }
  }